# エクササイズ1: このエクササイズではR言語のデフォルトで搭載されている関数の呼び方を学んでいきます。

# my_nameという変数にあなたの名前を代入して下さい


# nchar()を用いてname_lengthという変数にあなたの名前の文字数（スペースを含みます）を入力して下さい


# print()を用いてあなたの名前の文字数を出力して下さい


# now_doingという変数に、あなたの名前の後ろに"is programming!"という文字列を付与して下さい


# now_doingという変数を大文字にしてください


### ボーナス問題

# 1から100までの整数の中からあなたの好きな数を2つ選んでfav_1, fav_2という変数に代入して下さい


# fav_1, fav_2をそれぞれ201の平方根で割って、fav_1, fav_2の値を更新して下さい


# sum()を用いてfav_1とfav_2の合計値を算出し、raw_sumという変数に代入して下さい


# round()を用いてraw_sumを小数点第一位で四捨五入し、round_sumという変数に代入して下さい


# fav_1とfav_2を小数点第一位で四捨五入し、round_1, round_2という変数に代入して下さい


# sum_roundという変数に、round_1とround_2の合計値を代入して下さい


# max()を用いてround_sumとsum_roundのどちらが大きいか判定して下さい

