# エクササイズ3: このエクササイズではR言語であらかじめ提供されているデータを用いてデータフレームの操作方法を学んでいきます

# R言語であらかじめ提供されている "USPersonalExpenditure" データセットを`data()`を用いてロードして下さい
# データセットをロードすると `USPersonalExpenditure` という変数名の変数が作成されます


# `is.data.frame()`を用いて`USPersonalExpenditure`がデータフレームであるかどうかを確認して下さい


# `data.frame()`を用いて`USPersonalExpenditure`をデータフレームに変換して下さい


# データフレームの列名を表示して下さい


# データフレームの行名を表示して下さい


# 行名を値とする列を追加して下さい


# 1940年に"Personal Care"にいくらのお金が費やされたか算出して下さい


# 1960年に"Food and Tobacco"にいくらのお金が費やされたか算出して下さい


# 1960年に最もお金が費やされたカテゴリを特定して下さい


# lowest_category()という関数を定義して下さい
# この関数は年(year)を引数とし、その年に最もお金が費やされていないカテゴリを返り値とします


# lowest_category()を用いて、各年の最もお金が費やされていないカテゴリを特定して下さい
# ヒント: `sapply()`を使うと良いでしょう！

