# エクササイズ2: このエクササイズではR言語のベクトルのインデックスとフィルタリングの使い方を学んでいきます

# `first_ten`という変数に、コロン(:)オペレータを用いて10から20の整数を要素とするベクトルを代入して下さい


# `next_ten`という変数に、seq()を用いて21から30の整数を要素とするベクトルを代入して下さい


# `first_ten`と`first_ten`を結合して`all_numbers`というベクトルを作成して下さい


# `eleventh`という変数に、`all_numbers`の１１番目の要素を代入して下さい


# `some_numbers`という変数に、`all_numbers`の2番目から５番目の要素を代入して下さい


# `even`という変数に、1から１００までの数のうち偶数を要素とするベクトルを代入して下さい


# all()とモジュロ(%%)オペレータを用いて、`even`の要素が全て偶数であることを確認して下さい


# `phone_numbers`という変数に、8, 6, 7, 5, 3, 0, 9を要素とするベクトルを代入して下さい


# `prefix`という変数に、`phone_numbers`の1番目から3番目の要素を代入して下さい


# `small`という変数に、`phone_numbers`の要素で5以下の数値を要素とするベクトルを代入して下さい


# `large`という変数に、`phone_numbers`の要素で5より大きい数値を要素とするベクトルを代入して下さい


# `phone_numbers`の要素で5より大きい数値を5に置換して下さい


# `phone_numbers`の要素で奇数の要素を0に置換して下さい
