# エクササイズ5: このエクササイズではR言語で1961年から2013年までの米国において人気の女性の名前に関するデータセットを操作していきます

# `names`という変数に`read.csv()`を用いて`female_names.csv`を代入して下さい


# `names_2013`という変数に`names`の2013年の行を代入して下さい


# 2013年に最も人気のあった女性の名前を抽出して下さい


# `most_popular_in_year()`という関数を定義して下さい
# この関数は、年(year)を引数とし、最も人気のあった女性の名前を返り値とします


# `most_popular_in_year()`を用いて1994年に最も人気のあった女性の名前を抽出して下さい


# `number_in_million()`という関数を定義して下さい
# この関数は、名前(name)と年(year)を引数とし、１００万人中何人その名前の赤ちゃんがいたのかを返り値とします


# 1995年に'Laura'という名前の赤ちゃんが１００万人中何人いたかを算出して下さい

