# エクササイズ1: このエクササイズではR言語でベクトルを作成、操作する方法を学んでいきます。

# `names`という変数名であなたと他2名の名前を要素としたベクトルを作成し、print()でベクトルを表示して下さい


# `n`という変数名で、コロン(:)オペレータを用いて１０から４９までの整数を要素とするベクトルを作成して下さい


# length()を用いて`n`の要素数を計算して下さい


# `n`の全ての要素に1を足して結果を出力して下さい


# `m`という変数名で、seq()を用いて10から1までの整数を要素とするベクトルを作成して下さい


# リサイクルを用いて`m`から`n`を引いて下さい


# `x_range`という変数名で、seq()を用いて-5から10まで0.1刻みの数値を要素とするベクトルを作成して下さい


# `x_range`をsin()の引数としてベクトルを作成し、`sin_wave`という変数に代入して下さい


# `x_range`をcos()の引数としてベクトルを作成し、`cos_wave`とい


# `wave`という変数名で、`sin_wave`と`sin_wave`を掛けた結果を要素とするベクトルを作成して下さい


# plot()を用いて`wave`を描画して下さい！
