# エクササイズ２: このエクササイズではR言語でデータフレームの操作方法を学んでいきます

# ("Employee 1", "Employee 2", ... "Employee 100")という要素を持つベクトルを作成して下さい
# ヒント: `paste()`とリサイクルを用いると良いでしょう!


# `runif()`を用いて40,000以上、50,000未満の値を１００個要素に持つベクトルを作成して下さい
# この値はEmployee Nの2017年の給与になります


# `runif()`を用いて-5,000以上、10,000未満の値を１００個要素に持つベクトルを作成して下さい
# この値は給与の増減額になります


# これら3つのベクトルを用いて`salaries`という変数名のデータフレームを作成して下さい


# `salaries`データフレームに2018年の給与の列を作成して下さい


# `salaries`データフレームに給与が増加したことを示す列を作成して下さい


### 以降のエクササイズではデータフレームから値を取得していきます
### 値を取得する際には行全体ではなくセルの値を取得するようにして下さい


# Employee 57の2018年の給与を取得して下さい


# 給与が上がった従業員(Employee)が何人いるかカウントして下さい


# 昇給額が最大の値を取得して下さい


# 昇給額が最大だった従業員(Employee)を取得して下さい


# 減給額が最大の値を取得して下さい


# 減給額が最大だった従業員(Employee)が何人いるかをカウントして下さい


# 給与の増減額の平均値を取得して下さい


# 昇給しなかった従業員(Employee)を対象に、減給額の平均を取得して下さい


# データフレームを.csvファイルとしてワーキングディレクトリに出力して下さい


