# エクササイズ3: このエクササイズではR言語のベクトルの使い方を練習していきます。

# `words`という変数に、6以上の文字列を要素として持つベクトルを代入して下さい
# 文字が思いつかない/必要あれば Google で random word generator と検索してみて下さい


# `words_of_the_day`という変数に、`words`に"is the word of the day!"という文字列を加えて代入して下さい
# ボーナスエクササイズ： `words`をシングルクォート(')で囲み、"is the word of the day!"という文字列を加えて`words_of_the_day`という変数に代入して下さい


# `a_f_words`という変数に、`words`の要素でaからfのアルファベットから始まる文字列を要素とするベクトルを代入して下さい
# ヒント: <= オペレータを用いることで、fより前に来るアルファベットかどうかを判定出来ます！
# アドバイス: wordsの全ての要素は小文字(lower-case)にしておいて下さい


# `g_m_words`という変数に、`words`の要素でgからmのアルファベットから始まる文字列を要素とするベクトルを代入して下さい


# word_bin()という関数を定義して下さい
# この関数は`words`ベクトル、2文字のアルファベットを引数とします
# また、この関数は引数の2文字のアルファベットの間のアルファベットから始まる文字列を要素とするベクトルを返り値とします


# `word_bin()`を用いて、`words`のうち`e`から`q`の間の英単語から始まる単語を抽出して下さい

